package hyx.invoice.sdk;

import java.text.DecimalFormat;
import java.util.ArrayList;
import java.util.List;
import java.util.Map;

import net.sf.json.JSONArray;

/**
 * 发票匹配SDK
 * 
 * @author HYX
 *
 */
public class InvoiceSDK {

	private static DecimalFormat df = new DecimalFormat("#.00");

	/**
	 * 设置需加载的文件路径 （训练或初始化前都务必且只需要调用一次该方法）
	 * 
	 * @param dataPath 训练语料和模型文件路径
	 * @throws Exception
	 */
	public static void setDataPath(String dataPath) throws Exception {
		System.out.println("设置需加载的文件路径...");
		InvoiceNLP.setDataPath(dataPath);
	}

	/**
	 * 加载企业行业代码
	 * 
	 * @param companyClass 企业行业代码 Map<String, Integer>结构 key=企业税号，value=行业代码
	 * @throws Exception
	 */
	public static void setCompanyClass(Map<String, Integer> companyClass) throws Exception {
		System.out.println("加载企业行业代码...");
		InvoiceNLP.setCompanyClass(companyClass);
	}

	/**
	 * 训练模型 单独运行一次训练方法
	 * 
	 * @param inWords  进项明细，JSONArray结构
	 *                 如：[{"id":"430303630110203","data":"电磁流量计"},{"id":"430303630110203","data":"PVC国标活接球阀"}]
	 * @param outWords 销项明细，JSONArray结构 同上
	 * @throws Exception
	 */
	public static void train(JSONArray inWords, JSONArray outWords) throws Exception {
		System.out.println("开始训练模型...");
		InvoiceNLP.setInORoutWord("in", inWords);
		InvoiceNLP.setInORoutWord("out", outWords);
		System.out.println("模型训练完成!");

	}

	/**
	 * 加载模型 启动时加载一次即可
	 * 
	 * @throws Exception
	 */
	public static void init() throws Exception {
		System.out.println("开始加载模型...");
		InvoiceNLP.init();
		System.out.println("模型加载完成!");
	}

	/**
	 * 获取发票明细匹配关联度
	 * 
	 * @param inWord  进项明细 单个明细String
	 * @param outWord 经过initOutWords返回的销售明细 List<String>
	 * @return 保留了两位小数浮点型的匹配关联度,0到100分之间
	 * 
	 * @throws Exception
	 */
	public static double matchWord(String inWord, List<String> outWord) throws Exception {

		double result = 0;
		try {
			result = Double.parseDouble(df.format(InvoiceNLP.smoothScore(InvoiceNLP.matchInWord(inWord, outWord))));
		} catch (Exception e) {

		}
		return result;
	}

	/**
	 * 对每个公司的销售明细初始化加载
	 * 
	 * @param compClass 公司行业代码 int 型
	 * 
	 * @param outWord   销售明细 String数组
	 * @return 传入matchWord的List<String>
	 * @throws Exception
	 */
	public static List<String> initOutWords(int compClass, String[] outWord) throws Exception {

		List<String> result = new ArrayList<String>();
		try {
			result = InvoiceNLP.initOutWords(compClass, outWord);
		} catch (Exception e) {

		}
		return result;
	}

//	public static void main(String[] args) throws Exception {
//		// train();//单独运行一次训练再去运行下面的调用，调用前先init在内存里再每次循环调用matchWord函数
//		setDataPath("E:/NewData/");
//		setCompanyClass(InvoiceNLP.setClass());
////		train(InvoiceNLP.getInORoutWords("in"), InvoiceNLP.getInORoutWords("out"));
//		// init("/root/NLP/Invoice/data/");// 启动时调用一次即可，大概需要将近1G的内存空间，几分钟的加载时间
//		init();
//
//		String inString = "*设计服务*活动策划服务费,*印刷品*温馨提示贴,*交通运输设备*汽车脚垫,*交通运输设备*汽车脚垫,*交通运输设备*尾箱垫,*交通运输设备*中网,*交通运输设备*踏板,*交通运输设备*踏板,*交通运输设备*电动尾门,*交通运输设备*电动尾门,*交通运输设备*电动尾门,*交通运输设备*踏板,*交通运输设备*踏板,*交通运输设备*电动尾门,*交通运输设备*电动尾门,*交通运输设备*电动尾门,*交通运输设备*踏板,*交通运输设备*踏板,*交通运输设备*电动尾门,*交通运输设备*踏板,*交通运输设备*踏板,*交通运输设备*踏板,*交通运输设备*踏板,*交通运输设备*踏板,*交通运输设备*电动尾门,*交通运输设备*电动尾门,*交通运输设备*电动尾门,*交通运输设备*电动尾门,*交通运输设备*电动尾门,*其他机械设备*通风座椅,*其他机械设备*内饰麂皮,*其他机械设备*内饰麂皮,*其他机械设备*无钥匙进入系统,*其他机械设备*无钥匙进入系统,*其他机械设备*无钥匙进入系统,*其他机械设备*无钥匙进入系统,*其他机械设备*无钥匙进入系统,*其他机械设备*无钥匙进入系统,*其他机械设备*摄像头,*其他机械设备*解码器,*其他机械设备*行车记录仪,*其他机械设备*摄像头,*其他机械设备*解码器,*其他机械设备*行车记录仪,*会展服务*展览服务费,*印刷品*微章,*金融服务*收单业务服务费,*金融服务*收单业务服务费,*纸制品*信封,*设计服务*策划服务费,*设计服务*策划服务费,*住宿服务*住宿费,*印刷品*广告印刷品制作费,*家具*椅子底板,*住宿服务*住宿费,*水冰雪*代收代付水费(2018年3-4月）,*住宿服务*房费,*住宿服务*房费,*生活服务*除虫灭鼠服务,*电动机*轮毂,*塑料制品*汽车膜 LL-FMFH75-2,*塑料制品*汽车膜 LL-FMFR75-1,*塑料制品*汽车膜 LL-FMFR75-2,*塑料制品*汽车膜 LL-MFH75/45-1,*塑料制品*汽车膜 LL-MFH75/45-2,*塑料制品*汽车膜 LL-MFR75/15-1,*塑料制品*汽车膜 LL-MFR75/15-2,*塑料制品*汽车膜 LL-MFR75/30-1,*塑料制品*汽车膜 LL-MFR75/45-1,*塑料制品*汽车膜 LL-MFR75/45-1,*塑料制品*汽车膜 LL-MFR75/45-2,*生活服务*汽车美容服务,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*皮革毛皮制品*脚垫,*交通运输设备*汽车隔热膜,*塑料制品*太阳膜,*塑料制品*太阳膜,*塑料制品*太阳膜,*塑料制品*太阳膜,*塑料制品*太阳膜,*塑料制品*太阳膜,*塑料制品*太阳膜,*塑料制品*太阳膜,*会展服务*展览服务费,*会展服务*展览服务费,*交通运输设备*电动尾门,*印刷品*印刷费,*纺织产品*簇绒脚垫,*皮革毛皮制品*后备箱垫,*皮革毛皮制品*汽车脚垫,*柴油*0号车用柴油,*汽油*95号汽油(国Ⅴ),*住宿服务*住宿费,*住宿服务*住宿费,*设计服务*策划服务费,*设计服务*策划服务费,*设计服务*策划服务费,*设计服务*策划服务费,*设计服务*策划服务费,*设计服务*策划服务费,*纸制品*信纸,*纸制品*信封,*信息技术服务*微信平台服务,*会展服务*展位费,*会展服务*展位费,*会展服务*展位费,*交通运输设备*脚踏板,*交通运输设备*脚踏板,*交通运输设备*脚踏板,*金融服务*收单业务服务费,*金融服务*收单业务服务费,*印刷品*印刷费,*交通运输设备*铰链,*电信服务*增值电信服务,*信息技术服务*信息技术服务,*电信服务*基础电信服务,*电信服务*增值电信服务,*信息技术服务*信息技术服务,*电信服务*基础电信服务,*电信服务*增值电信服务,*电信服务*增值电信服务,*经纪代理服务*代理服务费,*住宿服务*住宿费,*住宿服务*住宿费,*生活服务*汽车美容服务,*生活服务*汽车美容服务,*纺织产品*收纳四件套-灰,*纺织产品*收纳四件套-黑,*水冰雪*代收代付水费（2018年5月）,*经营租赁*场地费（2018年6月）,*计算机配套产品*墨盒,*计算机配套产品*墨盒,*塑料制品*硒鼓胶件,*塑料制品*硒鼓胶件,*塑料制品*硒鼓胶件,*塑料制品*硒鼓胶件,*现代服务*活动策划服务费,*非金属矿物制品*圆形黏扣砂纸（3无孔）,*交通运输设备*制动盘,*交通";
//		String outString = "*交通运输设备*传感器，前轮速度,*交通运输设备*空调除尘格,*交通运输设备*[022] 左前雾灯风网,*交通运输设备*O 形环,*交通运输设备*G/右前避震机,*交通运输设备*前挡风玻璃(610),*交通运输设备*雨刮水壶,*交通运输设备*空调滤芯(Code P21),*经纪代理服务*保险代理手续费,*交通运输设备*后保险杠,*交通运输设备**轮胎,米其林,255,45,R,18,*交通运输设备*出风口香薰,*交通运输设备*刹车灯线,*交通运输设备*蓄电池,80Ah,*交通运输设备*饰条,前档玻璃(左),*交通运输设备*空调格,*现代服务*服务费,*交通运输设备*Me卡通小车手机支架玫瑰金色款,*交通运输设备*螺丝，后视镜架,*交通运输设备*盖板,仪表台,右侧,*交通运输设备*右前门壳,*鉴证咨询服务*车辆物流综合服务,*交通运输设备*托架,左前龙门架,*交通运输设备*Q12/左后门电镀,*交通运输设备*空调滤芯,*交通运输设备*左后视镜架,*交通运输设备*放油螺丝,液力变距器,*经营租赁*汽车租赁费,*交通运输设备*波箱油底垫,*交通运输设备*空调活性碳滤芯,*交通运输设备*副水壶水管,*交通运输设备*头盖胶条,*交通运输设备*722.9波箱油,蓝色,(1L)(CodeA89),*交通运输设备*雨伞（蓝色）,*交通运输设备*水泵垫,*劳务*汽车维修费,*交通运输设备*轮胎螺丝(黑色,内六角),*交通运输设备*空气滤芯,*交通运输设备*空气滤芯（方型）,*交通运输设备*连杆,*交通运输设备*连杆瓦,*交通运输设备*尾箱通风口,*交通运输设备*[022] Mercedes me行李箱-磨砂银,*交通运输设备*火花塞(M276),*交通运输设备*前轮轴承,*交通运输设备*[022] 前传动轴(波箱-分动箱),*交通运输设备*散热器格栅(喷漆),*交通运输设备*空气避震器（前),*交通运输设备*汽油箱浮子(Y4),*交通运输设备*收纳四件套-灰色,*交通运输设备*胶套,*交通运输设备*奔驰尾星,*交通运输设备*机油滤芯,*交通运输设备*右泡沫支架(C级),*交通运输设备*儿童座椅(1-4岁),*交通运输设备*止推片(上),*交通运输设备*038232/香氛蜡烛-蓝色,*交通运输设备*螺丝,波箱油底壳,*交通运输设备*胶螺母,*交通运输设备*止推片(下),*交通运输设备*保温杯,500ml,*劳务*维修费,*交通运输设备*放油介子,波箱,*交通运输设备*回收阀支架,*交通运输设备*冷凝器,*交通运输设备*锁匙环,Giveaway,*交通运输设备*头盖,*交通运输设备*空气滤芯(M002),*交通运输设备*新春系列刺绣靠枕-莺歌燕舞,*交通运输设备*足球,*交通运输设备*037367/[022] Mercedes me Joy Me Series N,*交通运输设备*电子扇,*生活服务*汽车美容服务,*交通运输设备*备胎盘螺丝,*交通运输设备*支架,左前横梁,*交通运输设备*遥控电池,*润滑油*废机油,*交通运输设备*密封盖,电子电力装置,*交通运输设备*收纳四件套-黑色,*交通运输设备*波箱油滤清器,*交通运输设备*G/后避震器(左/右),*交通运输设备*smart钥匙扣,*交通运输设备*水箱导流罩(下),*交通运输设备*前横梁,*非成品油石油制品*废机油,*交通运输设备*机油格,CGI,*交通运输设备*AMG GT C, 敞篷跑车模(1:18),*交通运输设备*AMG C63车模(灰色,1:18),*交通运输设备*空气滤芯,CGI,*交通运输设备*新春系列刺绣靠枕-鸟语花香,*交通运输设备*Q24/刹车油(1L),*交通运输设备*[022] Q18/尿素水溶液(10L),*交通运输设备*038232/香氛蜡烛-黑色,*交通运输设备*靠背饰板,前座椅(左/右),*交通运输设备*油气管胶圈,*交通运输设备*雨刮器臂,*交通运输设备*Q60/控制模块,ABR,*鉴证咨询服务*服务费,*交通运输设备*火花塞,";
//		String[] in = inString.split(",");
//		String[] out = outString.split(",");
//		// 进项原材料
//		String[] jxycl = { "七氟丙烷灭火设备", "压力表开关", "三通", "轴流式消防排烟风机", "输出模块(201900)", "技术服务费", "物流辅助服务",
//				"点型感温火灾探测器(102100(AA))", "输入/输出模块", "画册", "消防电子产品", "火灾报警控制器/气体灭火控制器(505100)", "超细干粉灭火装置", "悬挂式七氟丙烷钢瓶",
//				"手/自动转换模块", "保费-机动车交通事故责任强制保险", "咨询服务费", "七氟丙烷（高纯）", "测试费", "爆破片", "消防检测", "监督复查费", "担保费", "火探管",
//				"无缝钢管Φ133*4.5", "点型光电感烟火灾探测器(102200(AA))", "机柜", "年金", "七氟丙烷", "排烟防火阀（常闭）", "单门消防柜", "电控", "七氟丙烷钢瓶",
//				"消防标签", "瓶阀水压试验机", "选择阀", "HFC-227灭火剂", "电磁驱动装置", "消防机柜", "感烟探测器", "五金件表面处理", "直通", "变径直通", "气瓶",
//				"悬挂喷嘴", "维修费", "放气指示灯", "镀锌钢管DN150*4.5*6000", "手持露点仪", "探测器底座(001000)", "壁式排风机", "(详见销货清单)", "火灾声警报器",
//				"悬挂式钢瓶", "（详见销货清单）", "火探瓶头阀", "信息技术服务费", "单门柜", "详见销货清单", "无缝钢管", "点型感温火灾探测器(102100)", "认证费", "钢瓶",
//				"文件柜", "能量色散X荧光光谱仪", "镀锌钢管DN80*4.0*6000", "悬挂式电磁容器阀", "sogou(搜狗)服务费", "探火管", "电梯保养费", "气瓶翻转倒水干燥一体机",
//				"消防瓶", "防雨百叶", "火灾声光报警器", "贮压式超细干粉灭火装置", "钢板", "消防设备", "服务费", "HFC-227ea", "sogou（搜狗）服务费", "紧急启停按钮",
//				"总线隔离模块", "单层可调百叶", "ABC超细干粉", "悬挂式干粉钢瓶", "模块底座(001900)", "信息费", "火灾报警控制器/气体灭火控制器(502200)", "双门柜",
//				"感温探测器", "冷板", "弯头", "气体灭火控制器", "气体喷洒释放灯", "保费-车辆商业保险" };
//		System.out.println(jxycl.length);
//		// 销项商品
//		String[] xxsp = { "温感探测器", "维修单瓶柜式灭火装置", "设备维修保养费及气体充装费", "紧急启停按钮", "灭火控制器", "七氟丙烷自动灭火系统", "电磁式悬挂灭火装置",
//				"七氟丙烷气体", "自动消防系统", "烟感探测器", "柜式灭火装置", "启动瓶", "自动泄压装置", "声光报警器", "七氟丙烷药剂", "防火阀", "柜式七氟丙烷灭火装置", "维修检测费",
//				"机械泄压口", "维修、检测费", "维修检测及药剂充装费", "气体灭火装置", "火探管", "七氟丙烷灭火装置", "4KG贮压悬挂式超音速干粉自动灭火装置", "定温悬挂式灭火装置",
//				"七氟丙烷灭火剂", "七氟丙烷火探管灭火装置", "3KG贮压悬挂式超音速干粉自动灭火装置", "设备维修、保养费", "七氟丙烷自动灭火装置", "选择阀", "电磁悬挂式灭火装置",
//				"灭火系统拆卸费", "检测、安装费", "药剂", "放气指示灯", "(详见销货清单)", "消防设备一批", "钢气瓶设备款", "消防警铃", "泄压装置", "消防设备", "专用泄压口",
//				"设备维修保养、药剂充装费", "管件", "悬挂式定温吊球", "气体灭火瓶", "维修检测费及气体充装费", "维修费及气体充装费", "驱动瓶组", "单瓶式柜式灭火装置", "气体灭火设备",
//				"泄压口" };
//		long start1 = System.currentTimeMillis();
//		List<String> outs = initOutWords(7241, out);// 先加载这个公司的销售明细
//		for (String test : in) {
//			long start = System.currentTimeMillis();
//			System.out.println(matchWord(test, outs) + "%");
//			System.out.println("use time " + (System.currentTimeMillis() - start) + " ms");
//		}
//		System.out.println("total use time " + (System.currentTimeMillis() - start1) + " ms");
//		// System.out.println(matchWord("电脑", teStrings) + "%");
//		// System.out.println(matchWord("哈哈", teStrings) + "%");
//		// System.out.println(matchWord("胶水", teStrings) + "%");
//		// System.out.println(matchWord("电子，油墨", "电子，电脑") + "%");
//		// System.out.println(matchWord("哈哈", "哈哈") + "%");
//		// System.out.println(matchWord("你猜", "你猜") + "%");
//	}

}
